# 功能：统一道路项目表格表头
# 要求：可方便扩展表格，公共属性，提供映射函数
#


class RoadExcelFormatColumns():  # 与road_excel.py中RoadExcel类有耦合
    def __init__(self):
        # {‘列标签（统一访问接口）'：[('1原标签中关键字1','1原标签中关键字2'),('2原标签中关键字2','2原标签中关键字2')] }
        # 解释：即将含有（'1原标签中关键字1','原标签中关键字2'）或者('2原标签中关键字2','2原标签中关键字2')的文本替换为‘列标签（统一访问接口）'
        # 元组中只有一个元素中时后面要加个逗号，如('桩号',)，才能保证'桩号'是个整体，否则遍历时会拆成桩、号
        self.columns = {
            '起讫桩号': [('桩号',)],
            '起点桩号': [('起点',), ('qd',)],
            '止点桩号': [('止点',), ('zd',)],
            '位置左幅': [('位置', '左'), ],
            '位置右幅': [('位置', '右'), ],
        }


class TfExcelFormatColumns(RoadExcelFormatColumns):
    def __init__(self):
        super().__init__()
        self.columns_add = {
            '挖方总数量': [('挖', '总数量')],
            '挖土方软土': [('挖', '软土'), ('挖', 'I')],
            '挖土方普通土': [('挖', '普通'), ('挖', 'Ⅱ')],
            '挖土方硬土': [('挖', '硬土'), ('挖', 'Ⅲ')],
            '废方总数量': [('废', '总数量'), ('弃', '总数量')],
            '废方软土方': [('废', '软土'), ('弃', 'I')],
            '废方土方': [('废', '土'), ('弃', '土')],
            '清表回填': [('清表', '回填')],
            }
        self.columns.update(self.columns_add)


class PsExcelFormatColumns(RoadExcelFormatColumns):
    def __init__(self):
        super().__init__()
        self.columns_add = {
            '边沟M7.5浆砌片石': [('边沟', 'M7.5浆砌片石')],
            '边沟盖板钢筋': [('边沟', '盖板钢筋')],
            }
        self.columns.update(self.columns_add)



